{
  "mainSection": {
    "title": "About David",
    "description": "David earned a Bachelor of Science in Honors English from the United States Naval Academy. That’s not a typo. He’s probably the only English major you’ll ever meet who took multiple semesters of calculus, physics, chemistry, electrical engineering, naval architecture, and weapons systems just so he could read some Shakespeare. It was totally worth it.\n\nAfter meeting Tom Clancy and reading *The Hunt for Red October* as a midshipman at the Naval Academy, he spent six years as a commissioned officer in the nuclear-powered submarine force chasing the Russians in the frigid waters of the North Atlantic. When the Soviet Union collapsed, David left the Navy for corporate life. For two decades, he schlepped his way around the globe as an itinerant executive in the high-tech sector, and even did a stint with a Silicon Valley startup.\n\nDavid is the creator of the sci-fi series *The Dream Guild Chronicles* and *INVINCIBLE*, the best-selling tie-in novel to Nick Webb’s *Legacy Fleet* military sci-fi series. His short fiction has appeared in numerous venues including *Compelling Science Fiction*, *Future Chronicles*, and *Beyond the Stars*.\n\nDavid also co-authors novels in two different genres. With retired naval intel officer JR Olson, he writes contemporary military thrillers that look less like fiction every time he checks the news. Their latest novel, *Rules of Engagement*, comes out in June 2019 from St Martin’s Press (Macmillan).\n\nWith co-author Chris Pourteau, David write the sci-fi series, *The SynCorp Saga*, about the corporate takeover of the solar system. The series consists of three books with more coming in spring 2019.",
    "headshot": "/images/uploads/david-author-pic-cropped-e1592421077137.jpg"
  },
  "videoSection": {
    "title": "Below is an interview with Karen Kodzik from Cultivating Careers about my transition from corporate executive to full-time writer.",
    "videoEmbedLink": "https://www.youtube.com/embed/cjBX1PlxYoI"
  }
}